Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །སྐྱེ་བོའི་ཚོགས་ཆེན་པོའི་ནང་དུ་ཞགས་པ་འཕངས་ཏེ། དོན་ཡོད་པའི་ཡིད་བཞིན་གྱི་ནོར་བུའི་གཟུངས་བཟླས་ན། ཅི་ལྟར་འཚལ་བ་ཡིད་ལ་བསམས་པ་བཞིན། མེ་ཏོག་དང་འབྲས་བུ་དང་། གཞལ་མེད་ཁང་གི་ཆར་འབབ་པར་འགྱུར་རོ།
en: If the vidyā holder casts the noose into a crowd of people while reciting the dhāraṇī of the wish-fulfilling amogha jewel, he will bring forth a rain of flowers, fruits, and palaces—anything he may wish for or think of. “

source: །རྒྱལ་མཚན་བསྒྲེང་བའི་རྩེ་མོར་བཞག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་བ་ཁྱིམ་གྱི་སྟེང་ངམ་ཁྱམས་སུ་བཞག་ལ།
en: The vidyā holder who follows the noble eightfold path can mount the jewel on the tip of a banner and set it up in the hall of the house of an anointed kṣatriya.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་ཀྱི་བསྙེན་གནས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་བརྩེ་བར་བགྱིད་དོ། །དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས། ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་པར་བགྱིའོ། །དེ་ནས་དོན་ཡོད་པའི་ཡིད་བཞིན་ནོར་བུའི་གཟུངས་ལན་བརྒྱ་རྩ་བརྒྱད་གསང་བསྟོད་དེ་བཟླས་བརྗོད་བགྱིའོ། །ལན་བརྒྱ་རྩ་བརྒྱད་ཚང་ནས། ཅི་ལྟར་ཡིད་ལ་བསམས་པ་བཞིན་ཆར་དུ་འབབ་པར་འགྱུར་རོ།
en: While feeling compassion for all beings, he should recite the heart mantra of Amogharāja twenty-one times, the mantra of Krodharāja twenty-one times, and then the dhāraṇī of the wish-fulfilling amogha-jewel one hundred and eight times in a loud voice.

source: །ནོར་དང་། འབྲུ་དང་། གོས་དང་། ལྷབ་ལྷུབ་ལ་སོགས་པ། མེ་ཏོག་དང་འབྲས་བུའི་ཆར་འབབ་པར་འགྱུར་རོ། །འཐབ་པ་དང་། འཐབ་མོ་དང་།
en: When he has reached the number one hundred and eight, a rain of whatever he has in mind will fall, whether it is money, grain, clothes, adornments, and so forth, along with flowers and fruits.

source: རྩོད་པ་དང་། འགྱེད་པ་དང་། མུ་གེའི་དགོན་པའི་འཇིགས་པ་དང་། ཡམས་དང་། གནོད་པ་དེ་དག་ཐམས་ཅད་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མཐུས་བབས་པར་འགྱུར་རོ།
en: All quarrels, arguments, contests, disputes, famine, the dangers that one meets with in the wilderness, and misfortunes will cease through the power of Noble Avalokiteśvara.

source: །ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: They will all be pacified.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཇིགས་པ་སྩོལ་བར་འགྱུར་རོ། །འཇིགས་པ་དང་ཤ་ཁོ་ན་ཐམས་ཅད་ལས་ཐར་བར་འགྱུར་རོ།
en: All beings will be granted fearlessness and released from all enmity and fear.

source: །གདུག་པ་ནས་གཅན་གཟན་ཁྲོ་བོ་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་བྱམས་པ་ལ་གནས་པར་འགྱུར་རོ།
en: All wicked beings, even wild animals, will become friendly.

source: །སེམས་ཅན་ཐམས་ཅད་མཐུན་པར་བགྱིད་པར་འགྱུར་རོ། །ཡིད་ཀྱི་བརྣག་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: All beings will be content, and all their wishes will be fulfilled. “

source: །དོན་ཡོད་ཡིད་བཞིན་ནོར་བུའི་ཞགས་པ་ཆེན་པོ་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This was the practice of the wish-fulfilling jewel-noose. “

source: དེ་ནས་རིག་སྔགས་འཆང་རལ་གྲི་དང་ཞགས་པ་བསྒྲུབ་པར་འཚལ་ན། རིག་སྔགས་འཆང་གིས་ལྕགས་ཆེན་པོ་ལས་རལ་གྲི་སོར་བཅུ་དྲུག་གི་ཚད་དུ་བགྱིས་ལ་ལག་ཟུངས་ཀྱི་ངོས་ལ་དངུལ་ལས་བགྱིས་ཏེ།
en: If the vidyā holder wants to accomplish the practice of the vidyādhara sword-noose, he should forge a sword of heavy iron that is sixteen fingers long.

source: གསེར་གྱིས་འབར་བར་བྲིའོ།
en: The handle should be made of silver and inlaid with shining gold.

source: །ཤིང་ཤུན་གྱི་སྐུད་པའམ། ཨརྐའི་སྐུད་པ་དང་། ཁ་ཆེ་དར་གྱི་སྐུད་པ་ལྷན་ཅིག་ཏུ་སྒྲིལ་ལ་ཁྲུ་བཅུ་དྲུག་བྱུང་བ་ཤིན་ཏུ་ཚད་ལ་བབ་པར་བཀུམ་པ། བསྒྲུབ་པའི་དགོས་པ་ཡོངས་སུ་རྫོགས་པ་ལ་སུམ་སྒྲིལ་དུ་བཀལ་བར་བགྱིའོ།
en: He should commission a thread made from tree bark, a thread made from giant milkweed, and a thread made from silk, each sixteen cubits long and prepared following the full procedure as required.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ལེགས་པར་ཁྲུས་བགྱིས་ཏེ།
en: These threads of equal length should be aligned lengthwise and twisted together. “

source: གཙང་མས་གོས་གཙང་མ་བགོས་ཏེ། ཞགས་པ་དང་། རལ་གྲི་མནན་ལ། ལག་པ་གཡས་པས་དཀྱིལ་འཁོར་ལ་བཞག་སྟེ་གཟུང་བར་བགྱིའོ། །ཁྲོས་པའི་གཉེར་གྱི་བཞིན་གྱིས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆིས་ནས།
en: The vidyā holder, ritually pure, bathed, and wearing clean clothes, should then attach the noose to the sword, place it inside a circular maṇḍala, and grasp the sword with his right hand while angrily knitting his eyebrows and making a fierce expression.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ཀྱི་མདུན་དུ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་པར་བགྱིའོ།
en: Sitting in a cross-legged posture in front of a painting of Noble Avalokiteśvara, the vidyā holder should recite the Krodharāja one thousand and eight times.

source: །བཟླས་བརྗོད་ལན་སྟོང་རྩ་བརྒྱད་ཚང་ནས། རལ་གྲི་འབར་བར་གྱུར་ནས། རིག་སྔགས་འཆང་ནམ་མཁའ་ལ་འཕུར་བར་འགྱུར་ཞིང་།
en: When the mantra has been recited the full one thousand and eight times, the sword will blaze with light, and the vidyā holder will ascend into the sky.

source: རལ་གྲི་གྲུབ་པའི་རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་གཙོ་བོ་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །གཞན་གྱི་མཐུས་ཟིལ་གྱིས་ནོན་པར་མི་འགྱུར་རོ། །ལོ་ཁྲི་བརྒྱད་སྟོང་དུ་འཚོ་བར་འགྱུར་རོ།
en: He will become the powerful emperor of all the sword-wielding vidyādharas and siddhas, will possess irresistible power and valor, and will live eighteen thousand years. “

source: །འོན་ཏེ་ལག་པ་གཡོན་པས་ཞགས་པ་བཟུང་ལ་གཡས་པས་རལ་གྲི་བཟུང་སྟེ། ཁྲོས་པས་ཧཱུྃ་ཞེས་བགྱི་བས་མནན་ན། མི་གདའ་བར་གྱུར་ནས། མི་གདའ་བ་དང་།
en: The vidyā holder will become invisible if he grasps the noose with his left hand, the sword with his right, and angrily pronounces the syllable hūṁ.

source: ཞགས་པ་དང་། རལ་གྲི་གྲུབ་པའི་རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་གཙོ་བོ་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །ཚེ་ལོ་ཁྲི་ཐུབ་པར་འགྱུར་རོ།
en: He will become a powerful king, an emperor of all the invisible siddhas and vidyādharas with their noose-swords, and he will live for ten thousand years. “

source: །འོན་ཏེ་རིག་སྔགས་འཆང་ཁྲོས་པས་རལ་གྲི་བསྐོར་ན། བགེགས་དང་། ལོག་འདྲེན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་གདུག་པ་ཐམས་ཅད་དང་། འབྱུང་པོ་ཐམས་ཅད་ཀྱི་རིག་སྔགས་གཅད་པར་འགྱུར་རོ།
en: If the vidyā holder swings the sword angrily, he will cut down all the vighnas, vināyakas, wicked yakṣas and rākṣasas, and all wicked bhūtas.

source: །གཡུལ་གྱི་དབུས་སུ་ལན་ཅིག་བསྐོར་ན། གཡུལ་འགྱེད་པའི་མཚོན་ཆ་ཐམས་ཅད་བཅད་པར་འགྱུར། རེངས་པར་བགྱིས་པར་འགྱུར་ཏེ།
en: If he swings the sword just once in the midst of a battle, he will shatter all the weapons of the warriors.

source: ཐམས་ཅད་ཕྱོགས་བཅུར་འབྱེར་བར་འགྱུར་རོ། །དུར་ཁྲོད་ཀྱི་ནང་དུ་བསྐོར་ན།
en: They will all be brought to a halt and will flee in the ten directions.

source: དུར་ཁྲོད་ན་གནས་པའི་གདུག་པ་རྒྱུ་བ་ཐམས་ཅད་ཀྱི་རིག་སྔགས་གཏུབས་པར་འགྱུར་ཞིང་། གནས་ཐམས་ཅད་སྟོངས་པར་འགྱུར་རོ།
en: If he swings the sword in the middle of a charnel ground, he will cut down all its wild inhabitants so that their houses are emptied out.

source: །ཕུག་གི་སྒོར་བསྐོར་ན། འཁྲུལ་འཁོར་དང་སྒོ་གླེགས་ཐམས་ཅད་དཀྲུགས་པར་འགྱུར་རོ། །སྒོ་དང་གཏན་པ་ཐམས་ཅད་གཏུབས་པར་འགྱུར་རོ།
en: If he swings the sword at any gate, all its locks and panels will split, and the door bolts will break.

source: །གདུག་པའི་མི་མ་ཡིན་པ་བར་ཆད་བགྱིད་པ་ཐམས་ཅད་བཅོམ་པར་འགྱུར། ཐལ་བར་བརླག་པར་འགྱུར་རོ། །གཞན་ཡང་དགོས་པ་ཐམས་ཅད་དུ་ཅི་ལྟར་འཚལ་བ་བཞིན་དུ་བགྱིད་པར་འགྱུར་རོ།
en: All the wicked nonhumans who roam around creating obstacles will be cut down and completely annihilated, while others will carry out whatever tasks the vidyā holder wants them to. “

source: །རལ་གྲི་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This was the practice procedure of the sword. “

source: དེ་ནས་ཡང་རིག་སྔགས་འཆང་སྦྲུལ་གྱི་ཞགས་པ་བསྒྲུབ་པར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་སྐུད་པ་ལྔ་ལས་བསྒྲུབས་ཏེ། ཚོན་རྩིས་ཁ་བསྒྱུར་བའི་སྐུད་པ་ཚད་བཞིན་དུ་གཏུབས་ལ། བསྒྲུབ་པར་ཤིན་ཏུ་འོས་པ་ལས་བསྒྲུབ་པར་བགྱིའོ། །དེ་ནས་ཟས་བཟང་པོའི་ཕྱེ་མ་དང་། མ་དྷུའི་མེ་ཏོག་དང་། ར་སའི་མེ་ཏོག་དང་།
en: If the vidyā holder wants to accomplish the practice of the snake noose, he should prepare five threads, dye them in the five colors, cut them to an appropriate length, and join them together so that they can be effectively used as part of the practice.

source: ལྡོང་རོས་དང་། པདྨ་གེ་སར་དང་། ནཱ་ག་པུཥྤ་དང་། ཤིང་ཨརྐའི་འོ་མ་དེ་ལྷན་ཅིག་ཏུ་སྦྱར་བ་དེར་བཙག་བཙལ་ཏེ། དུས་གཅིག་ཏུ་ལྷན་ཅིག་མཉམ་དུ་བཏགས་ཤིང་སྤྱི་བོར་ལེགས་པར་བསྐུ་སྟེ།
en: He should then take some pure food that has been powdered, madhupuṣpa, rasapuṣpa, realgar, lotus filaments, nāgapuṣpa, and the sap of giant milkweed, blend them with asafetida into a single compound of smooth consistency, and glue it firmly to the end of the cord.

source: དེ་ལ་དོན་ཡོད་རྒྱལ་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས། སྦྲུལ་འཁྱིལ་པ་མགོ་གསུམ་གྱི་གདེངས་ཀ་ཅན་ཡོངས་སུ་འཁྱིལ་པ་གསེར་གྱིས་གཡོགས་པ།
en: He should incant it with the mantra of Amogharāja one thousand and eight times, arrange it like a coiled snake—one with three heads, each with a hood—cover it with gold, and join them together.

source: ལེགས་པར་སྦྲེལ་བ་ནི་ཞགས་པའི་མཆོག་ལགས་སོ།
en: The supreme noose has six coils. “

source: །རིག་སྔགས་འཆང་གིས་ལེགས་པར་ཁྲུས་བགྱིས་ལ། གཙང་མས་གོས་གཙང་མ་བགོས་ཏེ། བའི་ལྕི་བའི་དཀྱིལ་འཁོར་གྲུ་བཞི་ཚད་བཞིན་བགྱིས་ཏེ།
en: The vidyā holder, ritually pure, bathed, and wearing clean clothes, should then use cow dung to make a four-sided maṇḍala of appropriate size.

source: དྲིས་མཆོད་པར་བགྱིའོ། །མེ་ཏོག་གི་སིལ་མ་དང་། བུམ་པ་གང་བས་བརྒྱན་པར་བགྱིའོ། །བ་དན་གྱིས་ཀུན་ནས་བརྒྱན་པར་བགྱིའོ།
en: He should perfume it with fragrances, strew it with flowers, array it with full jars, and adorn it with banners.

source: །དཀྱིལ་འཁོར་གྱི་དབུས་ཀྱི་གནས་སུ་སྟན་བཟང་པོ་བཤམས་ཏེ། དེའི་སྟེང་དུ་ཀླུའི་ཞགས་པ་བསྐྱིལ་ནས་གཞག་པར་བགྱིའོ། །སྦྲུལ་གྱི་མགོའི་གདེངས་ཀ་དབུས་མ་ནི་ཁ་ཤར་ཕྱོགས་སུ་བསྟན་ནོ།
en: In the center of the maṇḍala, he should make a divine seat and place the snake noose on it, arranged in a circle with the central snake’s hood facing east.

source: །དཀར་གསུམ་གྱི་གཏོར་མ་གཞག་པར་བགྱིའོ། །མཆོད་ཡོན་ཞབས་བསིལ་དཀར་པོའི་སྣོད་དང་། བདུག་པ་རྣམ་པ་གསུམ་པོ་ཙནྡན་དང་། ཨ་ག་རུ་དང་།
en: He should present a bali offering of the three ‘white’ foods, including argha water for the feet, and burn incense of sandalwood, agarwood, and olibanum.

source: དུ་རུ་སྐ་རྣམས་བསྲེག་གོ། །འབྲས་ཡོས་དང་། ཡུངས་ཀར་བཀྲམ་པའི་དཀྱིལ་འཁོར་བགྱིས་ལ།
en: He should sprinkle the maṇḍala with parched grain and mustard seeds. “

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མངོན་སུམ་དུ་བཞག་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བགྱིས་ཏེ།
en: Placing the noose in front of the painting of Noble Avalokiteśvara, the vidyā holder should make abundant offerings.

source: རིག་སྔགས་འཆང་གིས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ།
en: He should then sit in a cross-legged posture and follow the extensive recitation procedure, starting with the one thousand and eight recitations of the heart mantra of Amoghapāśa.

source: མཆིས་ནས་བཟླས་བརྗོད་མང་དུ་བགྱིའོ། །ཐོག་མར་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས། ཚངས་པ་དང་།
en: When this is complete, he should recite the Krodharāja, which is the supreme recitation, one thousand and eight times.

source: ཁྲོ་བོའི་རྒྱལ་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་པའི་ཡུངས་ཀར་རེ་རེ་ནས་སྦྲུལ་གྱི་མགོ་ལ་གཏོར་བར་བགྱིའོ།
en: With each recitation, he should cast a single mustard seed on to the snake’s head.

source: །སྒྲུབ་པ་ཐམས་ཅད་ཚང་ནས་ནི། །རྒྱུན་དུ་སྦྲུལ་ནི་འབར་བར་འགྱུར། །སྟན་ལས་ཞགས་པ་གཡོ་བ་ནི། །སོར་བཞི་ཙམ་གྱི་ཚད་ཙམ་དུ། །སྟན་ལས་གྱེན་དུ་འཕར་བར་འགྱུར།
en: When all the parts of the rite have been completed, the snake will invariably blaze with light, and the noose will move from its seat, rising to the height of four fingers. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་བཟུང་ནས་མི་གདའ་བར་གྱུར་ནས།
en: If the vidyā holder grasps the noose at that time, he will become invisible.

source: ཀླུའི་གནས་སུ་མཆིས་ཏེ། ཀླུའི་མཚོར་མཆིས་ན། ཀླུའི་གནས་ཀྱི་སྒོ་རྣམས་འབྱེ་བར་འགྱུར་རོ།
en: If he visits the abode of the nāgas, or stands in a nāga pond, the doors to the nāga dwelling will fall open.

source: །རིག་སྔགས་འཆང་གིས་ཞུགས་ཏེ་དོན་ཡོད་རྒྱལ་པོ་བཟླས་ནས། སྦྲུལ་གྱི་ཞགས་པ་ལན་གསུམ་དུ་བསྐོར་བར་བགྱིའོ།
en: He should enter while mindfully reciting the Amogharāja and swing the snake noose three times.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་བཅས་པ་མཆིས་ནས་རིག་སྔགས་འཆང་ལ་མངོན་སུམ་དུ་སྨྲ་བས་རིག་སྔགས་འཆང་ཞུགས་ཤིག་ཅེས་སྨྲ་བར་འགྱུར་རོ།
en: The nāga king will then arrive with his harem and retinue to welcome the vidyā holder, saying, ‘Come in, vidyā holder!’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་སྦྲུལ་གྱི་ཞགས་པ་བཟུང་སྟེ་བསྐོར་ནས་འཇུག་པར་བགྱིའོ།
en: The vidyā holder should then grasp the snake noose and enter while swinging it.

source: །དེ་ནས་རིགས་སྔགས་འཆང་གིས་ཀླུའི་སྐྱོན་དེ་མི་མཐོང་ཞིང་ནུབ་པར་འགྱུར་རོ།
en: The nāgas’ malice will entirely disappear; he will experience none of it.

source: །འཁྲུལ་འཁོར་དང་། སྒོ་གླེགས་དང་། གཏན་པ་ཐམས་ཅད་གཏུབས་ཤིང་བཅད་པར་འགྱུར་རོ།
en: Locks and doors will split and fall away.

source: །ཞུགས་པ་ཙམ་གྱི་མོད་ལ་ཀླུའི་བུ་མོ་གཟུགས་བཟང་མོ་མཛེས་མ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ཅིང་བཀླུབས་མ་མཛེས་མ་མཆིས་ནས། རིན་པོ་ཆེའི་ཕྲེང་བ་ཐོགས་ཏེ།
en: As soon as the vidyā holder enters, divine nāga girls will arrive, beautiful in form, kind, adorned with every ornament, and wearing garlands.

source: རིགས་སྔགས་འཆང་ལ་དབུལ་བར་བགྱིད་དོ།
en: They will bow to the vidyā holder. “

source: །རིགས་སྔགས་འཆང་གིས་བླངས་ནས་སྤྱི་བོ་ལ་བཞག་སྟེ།
en: The vidyā holder should grab one of the nāga girls and place her on his head.

source: བཞག་པ་ཙམ་གྱི་མོད་ལ་ཀླུའི་བུ་མོ་ནམ་མཁའ་ལ་འཕུར་ནས་ནུ་མ་གཉིས་ནས་འོ་མ་ཟགས་པ་དང་།
en: As soon as he does that, he will fly up into the sky together with the girl, her two breasts oozing milk.

source: རིག་སྔགས་འཆང་གིས་བཟེད་ནས་བཏུང་བར་བགྱི་སྟེ། ཚེ་ཉི་ཁྲི་ཐུབ་པར་འགྱུར་རོ།
en: If the vidyā holder takes some of the milk and drinks it, he will live twelve thousand years.

source: །སྐྲ་ཅུང་ཟད་འཁྱིལ་བར་ཡང་འགྱུར་རོ། །ཀླུའི་རྒྱལ་པོ་ཞེས་བགྱི་བ་ཐམས་ཅད་ཀྱི་བདག་པོ་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ།
en: His hair will form into curls, and he will become an emperor-like overlord of all the nāga kings.

source: །མཐུ་དང་བརྩོན་འགྲུས་ཆེན་པོས་ཕ་རོལ་གནོན་པར་འགྱུར་རོ།
en: He will be powerful, bold, and valorous. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་སྦྲུལ་གྱི་ཞགས་པ་བཞག་ལ། དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ཤིང་ཀ་ར་བཱི་རའི་ལྕུག་མ་ལ་བཟླས་ནས་བྱ་བ་པར་བགྱི་སྟེ། གང་དང་གང་གི་མིང་ནས་དྲངས་ཤིང་ཡིད་ལ་བསམས་པས་མོད་ལ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: If the vidyā holder mindfully repeats the heart mantra of the nāga noose and anoints himself with a sprig of oleander, he can summon whomever he has in mind, and in an instant they will be brought together.

source: །ཆར་མི་འབབ་པའི་དུས་སུ་སྦྲུལ་གྱི་ཞགས་པ་གནས་མཐོན་པོར་བསྐོར་བར་བགྱི་སྟེ། ལན་ཅིག་བསྐོར་བ་ཙམ་གྱིས་ཆར་གྱི་རྒྱུན་ཆེན་པོ་འབབ་པར་འགྱུར་རོ།
en: If, at the time of a drought, he swings the noose from an elevated place just once, a heavy rain will fall the instant he swings the noose.

source: །ཧ་ཅང་ཆར་ཆེས་པའི་དུས་སུ་སྦྲུལ་གྱི་ཞགས་པ་གནས་མཐོན་པོར་བཞག་ན་ཆར་ཧ་ཅང་ཆེ་བ་ལས་འཆད་པར་འགྱུར་རོ། །གྲང་བའམ།
en: If it rains too much, he should descend from that elevated place with snake noose, and the excessive rain will stop.

source: རླུང་ངམ། སེར་བ་འབབ་པའི་དུས་སུ་ནང་པར་སྔར་ཀླུའི་ཞགས་པ་ཕྱོགས་བཞིར་བསྐོར་ན། དཔག་ཚད་བརྒྱ་ཁོར་ཁོར་ཡུག་ཏུ་སེར་བ་འབབ་པར་མི་འགྱུར་རོ། །གྲང་བའི་རླུང་དང་སེར་བ་ཐམས་ཅད་བཅིངས་པར་འགྱུར་རོ། །ལོ་ཁྱུད་འཁོར་ཚང་བར་མཚམས་ཆེན་པོ་བཅིངས་པར་འགྱུར་རོ།
en: If it is cold, windy, or hailing, the vidyā holder should swing the nāga noose in the four directions before dawn, and hail will not fall for a radius of one hundred leagues, and the cold wind will cease. “

source: །ཉིན་གཅིག་བཞིན་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས་ཞགས་པ་ལག་པ་གཡས་པས་བཟློགས་ལ། ལག་པ་གཡོན་པས་བསྐྲད་པ་བགྱིས་ན། ཉིན་གཅིག་བཞིན་ལྷའི་ཞལ་ཟས་དང་། བཏུང་བ་འདོད་དགུ་ཐམས་ཅད་ཀླུའི་གནས་ནས་བྱུང་ནས་སྐྱེ་བོ་སྟོང་སྟོང་ཙམ་ལ་སྩོལ་བར་འགྱུར་རོ།
en: If, the vidyā holder recites the heart mantra of Amogharāja twenty-one times every day while winding the noose with his right hand and holding it back with his left, then every day all kinds of divine food, drink, and pleasure will appear from the nāga realm and be given to thousands upon thousands of beings.

source: །དེའི་དུག་ཐམས་ཅད་མཐོང་བ་ཙམ་གྱིས་དུག་མ་ལགས་པར་འགྱུར་རོ། །སྦྲུལ་གྱི་ཞགས་པ་ལག་པ་གཡས་པས་བཟུང་ལ།
en: All snake venom will be neutralized just by seeing it. “

source: ལག་པ་གཡོན་པས་ཀླུ་བཟུང་ནས། དཔྱིད་དམ། སྟོན་ཀའམ། སྤྲིན་ཆགས་པའི་དུས་སུ་ཞགས་པ་བསྐོར་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་བརྗོད་བགྱིས་ཏེ། ནམ་མཁའ་ལ་འཕངས་ན་མེ་ཏོག་དང་།
en: When there are clouds in the sky during the spring or autumn, the vidyā holder should grasp the nāga noose with his right hand while holding a snake with his left, swing the noose while repeating the Krodharāja, and then cast it into the air.

source: འབྲས་བུ་དང་། ལོ་ཏོག་བཟང་པོ་གང་ཅི་ཡང་རུང་བ་བཟང་པོ་ཤིན་ཏུ་སྨིན་པ། ཁ་ཟས་ཤིན་ཏུ་བཟང་པོ་ཐམས་ཅད་ནམ་མཁའི་ངོས་ལས་ས་ལ་འབབ་པར་འགྱུར་རོ། །གལ་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བསྐོར་ནས། ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ན།
en: Any flowers or fruits that are normally harvested when ready will fall from the sky down to earth, perfectly ripe and ready to eat. “

source: ཀླུའི་གཞལ་མེད་ཁང་དང་། གོས་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་འཕྱང་དང་། རྒྱན་ཐམས་ཅད་ས་ལ་འབབ་པར་འགྱུར་རོ།
en: If the vidyā holder swings the nāga noose twenty-one times while reciting the Krodharāja, the nāgas’ palaces, ornaments, clothes, jewelry, and adornments will all fall to earth.

source: །གལ་ཏེ་རིག་སྔགས་འཆང་གིས་ལན་ཉི་ཤུ་རྩ་གཅིག་ལས་ལྷག་པར་བསྐོར་ཅིང་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་བརྗོད་བགྱིས་ན་དེའི་ཚེ་ཀླུ་འཁོར་དང་བཅས་པ་གཞལ་མེད་ཁང་དང་བཅས་པར་སའི་སྟེང་དུ་ལྟུང་བར་འགྱུར་རོ།
en: If he swings the noose once more while bringing to mind the Krodharāja, the nāgas, along with their retinues and palaces, will fall to earth.

source: །གལ་ཏེ་རིག་སྔགས་འཆང་གིས་རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་བཅས་པ་དབང་དུ་བགྱི་བར་འཚལ་ན། ཞགས་པ་བཞག་ལ་ཡུངས་ཀར་ལ་དོན་ཡོད་རྒྱལ་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས་བསྣུན་ལ། དེ་ནས་སྦྲུལ་གྱི་ཞགས་པ་བླངས་ཏེ།
en: If the vidyā holder wants to enthrall a king together with his harem and retinue, he should set the noose down and throw mustard seeds at it one thousand and eight times, each time reciting the Amogharāja.

source: རྒྱལ་པོའི་ཁྱིམ་གྱི་ཕྱོགས་གང་ལགས་པ་དེར་ལྷག་པར་ཞགས་པ་བསྐོར་ན།
en: He should then grasp the noose and swing it specifically in the direction of the royal household.

source: རྒྱལ་པོའི་བཙུན་མོ་འཁོར་དང་བཅས་པ་དབང་དུ་གྱུར་ནས། ཇི་སྲིད་འཚོའི་བར་དུ་མཆིས་པར་འགྱུར་རོ།
en: The king, together with his harem and retinue, will fall under his thrall and will remain so for as long as he lives. “

source: །གཡུལ་འགྱེད་པ་ན་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་བརྗོད་བགྱིས་ནས་ཞགས་པ་གཡུལ་གྱི་དབུས་སུ་འཕངས་ན་སྦྲུལ་གདུག་པ་མིག་བགྲད་པ།
en: If during an armed conflict the vidyā holder casts the noose into the thick of the battle while reciting the Krodharāja, a great venomous serpent will appear with huge eyes and a flicking tongue.

source: ལྕེ་བསྒྱུར་བ་མིག་མེ་མདག་ལྟར་དམར་བ་འབྱུང་བར་འགྱུར་ཏེ། མཐོང་བ་ཙམ་གྱི་མོད་ལ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་ཕྱོགས་བཅུར་འབྱེར་བར་འགྱུར་རོ།
en: At the mere glance of its eyes, glowing like embers, all four divisions of the enemy army will flee in all directions.

source: །གཞན་ཡང་ཇི་ལྟ་ཇི་ལྟར་ཡིད་ལ་བསམས་པའི་དོན་དེ་ལྟ་དེ་ལྟ་བུར་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པར་འགྱུར་རོ།
en: The vidyā holder can also perform any other necessary tasks, whatever he may have in mind. “

source: །སྦྲུལ་གྱི་ཞགས་པ་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This was the practice procedure of the nāga noose. “

source: དེ་ནས་འབྱུང་པོའི་དབང་ཕྱུག་གི་ཞགས་པ་བསྒྲུབ་པར་འཚལ་ན། འབྲིའི་རྩིད་པ་དང་། རྩིད་པ་ཆེན་པོ་ལྷན་ཅིག་ཏུ་བཀལ་བ་དང་། ལྕགས་ལས་མདུང་རྩེ་གསུམ་པ་སོར་བཞིའི་ཚད་ཙམ་དུ་བགྱིས་ལ།
en: If the vidyā holder wants to accomplish the practice of the noose of the lord of bhūtas, he should twist the long hairs from the tail of a female yak into a single strand and attach it to an iron trident that is four fingers long.

source: དེ་ནས་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ཏེ།
en: Having fasted for one day and one night, he should recite the heart mantra of Amogharāja one thousand and eight times, and the mantra of Krodharāja one thousand and eight times.

source: ཉིན་ཞག་གཅིག་མཆིས་ལ་ལེགས་པར་ཁྲུས་བགྱིས་ཏེ། གཙང་མས་གོས་གཙང་མ་བགོ་བར་བགྱིའོ། །ཟླ་བ་མར་གྱི་ངོའི་ཚེས་བཅུ་བཞིའི་ཉིན་ཞག་གཅིག་གིས་བསྒྲུབ་པར་བགྱིའོ།
en: Ritually pure, bathed, and wearing clean clothes, he should do this practice on the fourteenth day and night of the dark fortnight.

source: །དེ་ནས་མདུང་རྩེ་གསུམ་པའི་ཞགས་པ་བླངས་ནས་འབྱུང་པོའི་དབང་ཕྱུག་གི་གཟུགས་འདྲ་བར་འགྱུར་རོ།
en: Then, when he grasps the trident noose, he will become identical in form with the lord of bhūtas.

source: །འབྱུང་པོ་ཐམས་ཅད་ཀྱི་བདག་པོ་ལོ་བརྒྱ་སྟོང་དུ་འཚོ་བར་འགྱུར་རོ། །འབྱུང་པོའི་གནས་ཀྱི་གཞལ་མེད་ཁང་ཐམས་ཅད་ཀྱི་བདག་པོར་འགྱུར་རོ།
en: As the lord of all the bhūtas, he will live eight thousand years and rule over the palaces of the bhūtas. “

source: །ཞགས་པ་ལག་པར་ཐོགས་ནས། དུར་ཁྲོད་དུ་ཞུགས་ན། དུར་ཁྲོད་ན་གནས་པ་ཐམས་ཅད་མདུན་དུ་མཆིས་ཏེ།
en: If the vidyā holder enters a charnel ground with the noose in his hand, all the dwellers therein will gather before him.

source: གནས་ཀྱི་སྒོ་ཐམས་ཅད་འབྱེ་བར་འགྱུར་ཞིང་ཁྱོད་ཅི་དགར་ཞུགས་ཤིག་ཅེས་ཅི་འཚལ་བདེ་བགྱིད་པར་འགྱུར་རོ།
en: The doors to all their dwellings will be open, and they will invite him to enter and do what he pleases.

source: །རོའི་མགུལ་དུ་བཏགས་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་ན་དེ་ནས་རོ་ལངས་ནས་ཅི་དྲིས་པ་དེ་སྨྲ་བར་འགྱུར་ཞིང་། ཅི་བསྒོ་བ་དེ་བགྱིད་པར་འགྱུར་རོ།
en: If the vidyā holder ties the noose around the neck of a corpse and pulls it while bringing to mind the Krodharāja mantra, the corpse will attend to him, tell him whatever he wants to know, and do whatever the vidyā holder commands.

source: །བཀྲོལ་ན་འཆི་བར་འགྱུར་རོ།
en: When the animating spirit is released, the dead body will be discarded. “

source: །གནོད་སྦྱིན་གྱི་མགུལ་དུ་བཏགས་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་ལ་ཁྲོས་པས་དྲངས་ནས། གནོད་སྦྱིན་དེ་ཡང་མདུན་དུ་མཆིས་ནས། རིགས་སྔགས་འཆང་ལ་རྗེ་བཙུན་བཀའ་སྩོལ་ཅིག་དང་།
en: If the vidyā holder ties the noose around the neck of a yakṣa and pulls him angrily while mindfully repeating the Krodharāja mantra, the yakṣa will approach the vidyā holder and say, ‘Command me, sir!

source: ཐམས་ཅད་བགྱིའོ་ཞེས་སྨྲ་བར་འགྱུར་རོ།
en: I will follow your orders.’

source: །རིག་སྔགས་འཆང་གིས་ཁྱོད་ཇི་སྲིད་འཚོའི་བར་དུ་ཁྲོ་བོའི་རྒྱལ་པོ་མངག་གཞུག་པའི་ལས་གྱིས་ཤིག་ཅེས་སྨྲ་བར་བགྱི་སྟེ།
en: The vidyā holder should say, ‘Be my servant and messenger for as long as I live!’ The yakṣa will reply, ‘So be it!’

source: བཀའ་བཞིན་འཚལ་ཞེས་དེ་ནས་ཉིན་གཅིག་བཞིན་བསྒོ་བ་བགྱིས་ན། ལས་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: From then on, every single day, the yakṣa will do whatever the vidyā holder commands. “

source: །གནོད་སྦྱིན་མོའི་མགུལ་དུ་བཏགས་ཏེ། ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་ན། གནོད་སྦྱིན་མོ་མཆིས་ནས། རིག་སྔགས་འཆང་གི་མདུན་དུ་མཆིས་ཏེ།
en: If the vidyā holder ties the noose around the neck of a yakṣiṇī and brings to mind the Krodharāja mantra, the yakṣiṇī will approach and stand before him.

source: རིག་སྔགས་འཆང་ལ་མིག་མི་འཛུམས་པར་བལྟ་ཞིང་།
en: Staring at the vidyā holder without blinking, she will ask, ‘What would you like me to do, vidyā holder?’

source: རིག་སྔགས་འཆང་ཅི་ཞིག་དོན་དུ་གཉེར་ཞེས་སྨྲ་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་གིས་ཁོ་བོ་ལ་མ་དང་། ཆུང་མ་དང་། སྲིང་མོས་བསྒྲུབ་པར་བྱ་བའི་དགོས་པ་གསུམ་བྱོས་ཤིག་ཅེས་བསྒོ་བར་བགྱིའོ།
en: The vidyā holder should say, ‘Perform one of the three roles for me: either that of a mother, a wife, or a sister!’

source: །གལ་ཏེ་མ་ཞིག་ཏུ་བགྱིད་ན་བུ་གཅིག་པ་བཞིན་དུ་བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་དང་། གོས་དང་། ནོར་དང་།
en: If she becomes his mother, she will care for him as if he were her son, looking after his food, drink, bed, clothes, money, and grain.

source: འབྲུས་ཡོངས་སུ་སྐྱོང་བར་བགྱིད་དོ། །ཆུང་མ་ཞིག་ཏུ་བགྱིད་ན། མཁོ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱི་དབང་ཕྱུག་དང་བདག་པོར་བགྱིད་ཅིང་། དེ་དང་ལྷག་པར་དགའ་བར་རྩེ་བས་ཕྱེ་བཞིན་འབྲང་བར་འགྱུར་རོ།
en: As a wife, she will furnish him with everything he needs, grant him masculine power, and join him in pleasure.

source: །གལ་ཏེ་སྲིང་མོ་ཞིག་ཏུ་བགྱིད་ན། ཡིད་ལ་བརྣག་པའི་འདོད་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིད་དོ།
en: If she becomes his sister, she will fulfill all his desires and make his wishes come true.

source: །དགོས་པ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: She will do everything that needs to be done.

source: །ཐམས་ཅད་དུ་རྒྱུག་ཅིང་སླར་ཡང་ལྡོག་པར་འགྱུར་རོ། །ཉིན་གཅིག་བཞིན་ལྷབ་ལྷུབ་དང་། གོས་དང་། རྒྱན་ཐམས་ཅད་སྩོལ་བར་བགྱིད་དོ།
en: She will go everywhere and return, day after day, bringing jewelry, clothes, ornaments, and adornments.

source: །ཉིན་གཅིག་བཞིན་གཞན་ཡང་ལྷའི་བུ་མོ་དག་རྩེད་མོའི་དོན་དུ་དགུག་པར་བགྱིད་དོ། །རྣམ་ཐོས་ཀྱི་མགུལ་དུ་བཏགས་ཏེ།
en: Every day she will procure celestial girls for his pleasure. “
